---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.ShearAreaStrongAxis
source: html/028f83f4-6de3-86c9-d7c1-9057736396fe.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.ShearAreaStrongAxis Property

Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).

## Syntax (C#)
```csharp
public double ShearAreaStrongAxis { get; set; }
```